## Apply result

Show apply for the following directories:

<details><summary>live/dev/bar</summary>


<pre>
20:55:06.965 INFO   Terragrunt Cache server is listening on 127.0.0.1:36215
20:55:06.965 INFO   Start Terragrunt Cache server
The stack at live/dev/bar will be processed in the following order for command apply:
Group 1
- Module ./network/vpc


[network/vpc] : Terraform used the selected providers to generate the following execution
[network/vpc] : plan. Resource actions are indicated with the following symbols:
[network/vpc] :   + create
[network/vpc] : Terraform will perform the following actions:
[network/vpc] :   # aws_cloudwatch_log_group.this[0] will be created
[network/vpc] :   + resource "aws_cloudwatch_log_group" "this" {
[network/vpc] :       + arn               = (known after apply)
[network/vpc] :       + id                = (known after apply)
[network/vpc] :       + log_group_class   = (known after apply)
[network/vpc] :       + name              = (known after apply)
[network/vpc] :       + name_prefix       = (known after apply)
[network/vpc] :       + retention_in_days = 7
[network/vpc] :       + skip_destroy      = false
[network/vpc] :       + tags              = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "cloudwatch-log-group-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + tags_all          = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "cloudwatch-log-group-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :     }
[network/vpc] :   # aws_eip.this will be created
[network/vpc] :   + resource "aws_eip" "this" {
[network/vpc] :       + allocation_id             = (known after apply)
[network/vpc] :       + arn                       = (known after apply)
[network/vpc] :       + associate_with_private_ip = "192.169.1.10"
[network/vpc] :       + association_id            = (known after apply)
[network/vpc] :       + carrier_ip                = (known after apply)
[network/vpc] :       + customer_owned_ip         = (known after apply)
[network/vpc] :       + domain                    = (known after apply)
[network/vpc] :       + id                        = (known after apply)
[network/vpc] :       + instance                  = (known after apply)
[network/vpc] :       + ipam_pool_id              = (known after apply)
[network/vpc] :       + network_border_group      = (known after apply)
[network/vpc] :       + network_interface         = (known after apply)
[network/vpc] :       + private_dns               = (known after apply)
[network/vpc] :       + private_ip                = (known after apply)
[network/vpc] :       + ptr_record                = (known after apply)
[network/vpc] :       + public_dns                = (known after apply)
[network/vpc] :       + public_ip                 = (known after apply)
[network/vpc] :       + public_ipv4_pool          = (known after apply)
[network/vpc] :       + tags                      = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "eip-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + tags_all                  = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "eip-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + vpc                       = (known after apply)
[network/vpc] :     }
[network/vpc] :   # aws_flow_log.this[0] will be created
[network/vpc] :   + resource "aws_flow_log" "this" {
[network/vpc] :       + arn                      = (known after apply)
[network/vpc] :       + iam_role_arn             = (known after apply)
[network/vpc] :       + id                       = (known after apply)
[network/vpc] :       + log_destination          = (known after apply)
[network/vpc] :       + log_destination_type     = "cloud-watch-logs"
[network/vpc] :       + log_format               = (known after apply)
[network/vpc] :       + log_group_name           = (known after apply)
[network/vpc] :       + max_aggregation_interval = 600
[network/vpc] :       + tags                     = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "flow-log-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + tags_all                 = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "flow-log-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + traffic_type             = "ALL"
[network/vpc] :       + vpc_id                   = (known after apply)
[network/vpc] :     }
[network/vpc] :   # aws_iam_policy.this[0] will be created
[network/vpc] :   + resource "aws_iam_policy" "this" {
[network/vpc] :       + arn              = (known after apply)
[network/vpc] :       + attachment_count = (known after apply)
[network/vpc] :       + id               = (known after apply)
[network/vpc] :       + name             = "flow-log-policy-bar-app-dev"
[network/vpc] :       + name_prefix      = (known after apply)
[network/vpc] :       + path             = "/"
[network/vpc] :       + policy           = jsonencode(
[network/vpc] :             {
[network/vpc] :               + Statement = [
[network/vpc] :                   + {
[network/vpc] :                       + Action   = [
[network/vpc] :                           + "logs:CreateLogGroup",
[network/vpc] :                           + "logs:CreateLogStream",
[network/vpc] :                           + "logs:PutLogEvents",
[network/vpc] :                           + "logs:DescribeLogGroups",
[network/vpc] :                           + "logs:DescribeLogStreams",
[network/vpc] :                         ]
[network/vpc] :                       + Effect   = "Allow"
[network/vpc] :                       + Resource = "*"
[network/vpc] :                     },
[network/vpc] :                 ]
[network/vpc] :               + Version   = "2012-10-17"
[network/vpc] :             }
[network/vpc] :         )
[network/vpc] :       + policy_id        = (known after apply)
[network/vpc] :       + tags             = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + tags_all         = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :     }
[network/vpc] :   # aws_iam_role.this[0] will be created
[network/vpc] :   + resource "aws_iam_role" "this" {
[network/vpc] :       + arn                   = (known after apply)
[network/vpc] :       + assume_role_policy    = jsonencode(
[network/vpc] :             {
[network/vpc] :               + Statement = [
[network/vpc] :                   + {
[network/vpc] :                       + Action    = "sts:AssumeRole"
[network/vpc] :                       + Effect    = "Allow"
[network/vpc] :                       + Principal = {
[network/vpc] :                           + Service = "vpc-flow-logs.amazonaws.com"
[network/vpc] :                         }
[network/vpc] :                     },
[network/vpc] :                 ]
[network/vpc] :               + Version   = "2012-10-17"
[network/vpc] :             }
[network/vpc] :         )
[network/vpc] :       + create_date           = (known after apply)
[network/vpc] :       + force_detach_policies = false
[network/vpc] :       + id                    = (known after apply)
[network/vpc] :       + managed_policy_arns   = (known after apply)
[network/vpc] :       + max_session_duration  = 3600
[network/vpc] :       + name                  = "flow-log-role-bar-app-dev"
[network/vpc] :       + name_prefix           = (known after apply)
[network/vpc] :       + path                  = "/"
[network/vpc] :       + tags                  = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + tags_all              = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + unique_id             = (known after apply)
[network/vpc] :       + inline_policy (known after apply)
[network/vpc] :     }
[network/vpc] :   # aws_iam_role_policy_attachment.this[0] will be created
[network/vpc] :   + resource "aws_iam_role_policy_attachment" "this" {
[network/vpc] :       + id         = (known after apply)
[network/vpc] :       + policy_arn = (known after apply)
[network/vpc] :       + role       = (known after apply)
[network/vpc] :     }
[network/vpc] :   # aws_internet_gateway.this will be created
[network/vpc] :   + resource "aws_internet_gateway" "this" {
[network/vpc] :       + arn      = (known after apply)
[network/vpc] :       + id       = (known after apply)
[network/vpc] :       + owner_id = (known after apply)
[network/vpc] :       + tags     = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "igw-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + tags_all = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "igw-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + vpc_id   = (known after apply)
[network/vpc] :     }
[network/vpc] :   # aws_nat_gateway.this will be created
[network/vpc] :   + resource "aws_nat_gateway" "this" {
[network/vpc] :       + allocation_id                      = (known after apply)
[network/vpc] :       + association_id                     = (known after apply)
[network/vpc] :       + connectivity_type                  = "public"
[network/vpc] :       + id                                 = (known after apply)
[network/vpc] :       + network_interface_id               = (known after apply)
[network/vpc] :       + private_ip                         = (known after apply)
[network/vpc] :       + public_ip                          = (known after apply)
[network/vpc] :       + secondary_private_ip_address_count = (known after apply)
[network/vpc] :       + secondary_private_ip_addresses     = (known after apply)
[network/vpc] :       + subnet_id                          = (known after apply)
[network/vpc] :       + tags                               = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "nat-gateway-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + tags_all                           = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "nat-gateway-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :     }
[network/vpc] :   # aws_route_table.private will be created
[network/vpc] :   + resource "aws_route_table" "private" {
[network/vpc] :       + arn              = (known after apply)
[network/vpc] :       + id               = (known after apply)
[network/vpc] :       + owner_id         = (known after apply)
[network/vpc] :       + propagating_vgws = (known after apply)
[network/vpc] :       + route            = [
[network/vpc] :           + {
[network/vpc] :               + cidr_block                 = "0.0.0.0/0"
[network/vpc] :               + nat_gateway_id             = (known after apply)
[network/vpc] :                 # (11 unchanged attributes hidden)
[network/vpc] :             },
[network/vpc] :         ]
[network/vpc] :       + tags             = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "private-route-table-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + tags_all         = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "private-route-table-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + vpc_id           = (known after apply)
[network/vpc] :     }
[network/vpc] :   # aws_route_table.public will be created
[network/vpc] :   + resource "aws_route_table" "public" {
[network/vpc] :       + arn              = (known after apply)
[network/vpc] :       + id               = (known after apply)
[network/vpc] :       + owner_id         = (known after apply)
[network/vpc] :       + propagating_vgws = (known after apply)
[network/vpc] :       + route            = [
[network/vpc] :           + {
[network/vpc] :               + cidr_block                 = "0.0.0.0/0"
[network/vpc] :               + gateway_id                 = (known after apply)
[network/vpc] :                 # (11 unchanged attributes hidden)
[network/vpc] :             },
[network/vpc] :         ]
[network/vpc] :       + tags             = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "public-route-table-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + tags_all         = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "public-route-table-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + vpc_id           = (known after apply)
[network/vpc] :     }
[network/vpc] :   # aws_route_table_association.private["private-subnet-1"] will be created
[network/vpc] :   + resource "aws_route_table_association" "private" {
[network/vpc] :       + id             = (known after apply)
[network/vpc] :       + route_table_id = (known after apply)
[network/vpc] :       + subnet_id      = (known after apply)
[network/vpc] :     }
[network/vpc] :   # aws_route_table_association.private["private-subnet-2"] will be created
[network/vpc] :   + resource "aws_route_table_association" "private" {
[network/vpc] :       + id             = (known after apply)
[network/vpc] :       + route_table_id = (known after apply)
[network/vpc] :       + subnet_id      = (known after apply)
[network/vpc] :     }
[network/vpc] :   # aws_route_table_association.public["public-subnet-1"] will be created
[network/vpc] :   + resource "aws_route_table_association" "public" {
[network/vpc] :       + id             = (known after apply)
[network/vpc] :       + route_table_id = (known after apply)
[network/vpc] :       + subnet_id      = (known after apply)
[network/vpc] :     }
[network/vpc] :   # aws_subnet.private["private-subnet-1"] will be created
[network/vpc] :   + resource "aws_subnet" "private" {
[network/vpc] :       + arn                                            = (known after apply)
[network/vpc] :       + assign_ipv6_address_on_creation                = false
[network/vpc] :       + availability_zone                              = "us-west-1a"
[network/vpc] :       + availability_zone_id                           = (known after apply)
[network/vpc] :       + cidr_block                                     = "192.169.2.0/24"
[network/vpc] :       + enable_dns64                                   = false
[network/vpc] :       + enable_resource_name_dns_a_record_on_launch    = false
[network/vpc] :       + enable_resource_name_dns_aaaa_record_on_launch = false
[network/vpc] :       + id                                             = (known after apply)
[network/vpc] :       + ipv6_cidr_block_association_id                 = (known after apply)
[network/vpc] :       + ipv6_native                                    = false
[network/vpc] :       + map_public_ip_on_launch                        = false
[network/vpc] :       + owner_id                                       = (known after apply)
[network/vpc] :       + private_dns_hostname_type_on_launch            = (known after apply)
[network/vpc] :       + tags                                           = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "private-subnet-bar-app-dev-1a"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + tags_all                                       = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "private-subnet-bar-app-dev-1a"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + vpc_id                                         = (known after apply)
[network/vpc] :     }
[network/vpc] :   # aws_subnet.private["private-subnet-2"] will be created
[network/vpc] :   + resource "aws_subnet" "private" {
[network/vpc] :       + arn                                            = (known after apply)
[network/vpc] :       + assign_ipv6_address_on_creation                = false
[network/vpc] :       + availability_zone                              = "us-west-1b"
[network/vpc] :       + availability_zone_id                           = (known after apply)
[network/vpc] :       + cidr_block                                     = "192.169.3.0/24"
[network/vpc] :       + enable_dns64                                   = false
[network/vpc] :       + enable_resource_name_dns_a_record_on_launch    = false
[network/vpc] :       + enable_resource_name_dns_aaaa_record_on_launch = false
[network/vpc] :       + id                                             = (known after apply)
[network/vpc] :       + ipv6_cidr_block_association_id                 = (known after apply)
[network/vpc] :       + ipv6_native                                    = false
[network/vpc] :       + map_public_ip_on_launch                        = false
[network/vpc] :       + owner_id                                       = (known after apply)
[network/vpc] :       + private_dns_hostname_type_on_launch            = (known after apply)
[network/vpc] :       + tags                                           = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "private-subnet-bar-app-dev-1c"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + tags_all                                       = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "private-subnet-bar-app-dev-1c"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + vpc_id                                         = (known after apply)
[network/vpc] :     }
[network/vpc] :   # aws_subnet.public["public-subnet-1"] will be created
[network/vpc] :   + resource "aws_subnet" "public" {
[network/vpc] :       + arn                                            = (known after apply)
[network/vpc] :       + assign_ipv6_address_on_creation                = false
[network/vpc] :       + availability_zone                              = "us-west-1a"
[network/vpc] :       + availability_zone_id                           = (known after apply)
[network/vpc] :       + cidr_block                                     = "192.169.1.0/24"
[network/vpc] :       + enable_dns64                                   = false
[network/vpc] :       + enable_resource_name_dns_a_record_on_launch    = false
[network/vpc] :       + enable_resource_name_dns_aaaa_record_on_launch = false
[network/vpc] :       + id                                             = (known after apply)
[network/vpc] :       + ipv6_cidr_block_association_id                 = (known after apply)
[network/vpc] :       + ipv6_native                                    = false
[network/vpc] :       + map_public_ip_on_launch                        = true
[network/vpc] :       + owner_id                                       = (known after apply)
[network/vpc] :       + private_dns_hostname_type_on_launch            = (known after apply)
[network/vpc] :       + tags                                           = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "public-subnet-bar-app-dev-1a"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + tags_all                                       = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "public-subnet-bar-app-dev-1a"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + vpc_id                                         = (known after apply)
[network/vpc] :     }
[network/vpc] :   # aws_vpc.this will be created
[network/vpc] :   + resource "aws_vpc" "this" {
[network/vpc] :       + arn                                  = (known after apply)
[network/vpc] :       + cidr_block                           = "192.169.0.0/16"
[network/vpc] :       + default_network_acl_id               = (known after apply)
[network/vpc] :       + default_route_table_id               = (known after apply)
[network/vpc] :       + default_security_group_id            = (known after apply)
[network/vpc] :       + dhcp_options_id                      = (known after apply)
[network/vpc] :       + enable_dns_hostnames                 = true
[network/vpc] :       + enable_dns_support                   = true
[network/vpc] :       + enable_network_address_usage_metrics = (known after apply)
[network/vpc] :       + id                                   = (known after apply)
[network/vpc] :       + instance_tenancy                     = "default"
[network/vpc] :       + ipv6_association_id                  = (known after apply)
[network/vpc] :       + ipv6_cidr_block                      = (known after apply)
[network/vpc] :       + ipv6_cidr_block_network_border_group = (known after apply)
[network/vpc] :       + main_route_table_id                  = (known after apply)
[network/vpc] :       + owner_id                             = (known after apply)
[network/vpc] :       + tags                                 = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "vpc-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :       + tags_all                             = {
[network/vpc] :           + "application_name" = "bar"
[network/vpc] :           + "contact_email"    = "bar-team@example.com"
[network/vpc] :           + "environment"      = "development"
[network/vpc] :           + "managed_by"       = "terraform"
[network/vpc] :           + "name"             = "vpc-bar-app-dev"
[network/vpc] :           + "team_owner"       = "bar-team"
[network/vpc] :         }
[network/vpc] :     }
[network/vpc] : Plan: 17 to add, 0 to change, 0 to destroy.
[network/vpc] : Changes to Outputs:
[network/vpc] :   + cloudwatch_log_group_name = (known after apply)
[network/vpc] :   + flow_log_id               = (known after apply)
[network/vpc] :   + internet_gateway_id       = (known after apply)
[network/vpc] :   + nat_gateway_id            = (known after apply)
[network/vpc] :   + private_subnets           = {
[network/vpc] :       + private-subnet-1 = {
[network/vpc] :           + arn                                            = (known after apply)
[network/vpc] :           + assign_ipv6_address_on_creation                = false
[network/vpc] :           + availability_zone                              = "us-west-1a"
[network/vpc] :           + availability_zone_id                           = (known after apply)
[network/vpc] :           + cidr_block                                     = "192.169.2.0/24"
[network/vpc] :           + customer_owned_ipv4_pool                       = null
[network/vpc] :           + enable_dns64                                   = false
[network/vpc] :           + enable_lni_at_device_index                     = null
[network/vpc] :           + enable_resource_name_dns_a_record_on_launch    = false
[network/vpc] :           + enable_resource_name_dns_aaaa_record_on_launch = false
[network/vpc] :           + id                                             = (known after apply)
[network/vpc] :           + ipv6_cidr_block                                = null
[network/vpc] :           + ipv6_cidr_block_association_id                 = (known after apply)
[network/vpc] :           + ipv6_native                                    = false
[network/vpc] :           + map_customer_owned_ip_on_launch                = null
[network/vpc] :           + map_public_ip_on_launch                        = false
[network/vpc] :           + outpost_arn                                    = null
[network/vpc] :           + owner_id                                       = (known after apply)
[network/vpc] :           + private_dns_hostname_type_on_launch            = (known after apply)
[network/vpc] :           + tags                                           = {
[network/vpc] :               + application_name = "bar"
[network/vpc] :               + contact_email    = "bar-team@example.com"
[network/vpc] :               + environment      = "development"
[network/vpc] :               + managed_by       = "terraform"
[network/vpc] :               + name             = "private-subnet-bar-app-dev-1a"
[network/vpc] :               + team_owner       = "bar-team"
[network/vpc] :             }
[network/vpc] :           + tags_all                                       = {
[network/vpc] :               + application_name = "bar"
[network/vpc] :               + contact_email    = "bar-team@example.com"
[network/vpc] :               + environment      = "development"
[network/vpc] :               + managed_by       = "terraform"
[network/vpc] :               + name             = "private-subnet-bar-app-dev-1a"
[network/vpc] :               + team_owner       = "bar-team"
[network/vpc] :             }
[network/vpc] :           + timeouts                                       = null
[network/vpc] :           + vpc_id                                         = (known after apply)
[network/vpc] :         }
[network/vpc] :       + private-subnet-2 = {
[network/vpc] :           + arn                                            = (known after apply)
[network/vpc] :           + assign_ipv6_address_on_creation                = false
[network/vpc] :           + availability_zone                              = "us-west-1b"
[network/vpc] :           + availability_zone_id                           = (known after apply)
[network/vpc] :           + cidr_block                                     = "192.169.3.0/24"
[network/vpc] :           + customer_owned_ipv4_pool                       = null
[network/vpc] :           + enable_dns64                                   = false
[network/vpc] :           + enable_lni_at_device_index                     = null
[network/vpc] :           + enable_resource_name_dns_a_record_on_launch    = false
[network/vpc] :           + enable_resource_name_dns_aaaa_record_on_launch = false
[network/vpc] :           + id                                             = (known after apply)
[network/vpc] :           + ipv6_cidr_block                                = null
[network/vpc] :           + ipv6_cidr_block_association_id                 = (known after apply)
[network/vpc] :           + ipv6_native                                    = false
[network/vpc] :           + map_customer_owned_ip_on_launch                = null
[network/vpc] :           + map_public_ip_on_launch                        = false
[network/vpc] :           + outpost_arn                                    = null
[network/vpc] :           + owner_id                                       = (known after apply)
[network/vpc] :           + private_dns_hostname_type_on_launch            = (known after apply)
[network/vpc] :           + tags                                           = {
[network/vpc] :               + application_name = "bar"
[network/vpc] :               + contact_email    = "bar-team@example.com"
[network/vpc] :               + environment      = "development"
[network/vpc] :               + managed_by       = "terraform"
[network/vpc] :               + name             = "private-subnet-bar-app-dev-1c"
[network/vpc] :               + team_owner       = "bar-team"
[network/vpc] :             }
[network/vpc] :           + tags_all                                       = {
[network/vpc] :               + application_name = "bar"
[network/vpc] :               + contact_email    = "bar-team@example.com"
[network/vpc] :               + environment      = "development"
[network/vpc] :               + managed_by       = "terraform"
[network/vpc] :               + name             = "private-subnet-bar-app-dev-1c"
[network/vpc] :               + team_owner       = "bar-team"
[network/vpc] :             }
[network/vpc] :           + timeouts                                       = null
[network/vpc] :           + vpc_id                                         = (known after apply)
[network/vpc] :         }
[network/vpc] :     }
[network/vpc] :   + public_subnets            = {
[network/vpc] :       + public-subnet-1 = {
[network/vpc] :           + arn                                            = (known after apply)
[network/vpc] :           + assign_ipv6_address_on_creation                = false
[network/vpc] :           + availability_zone                              = "us-west-1a"
[network/vpc] :           + availability_zone_id                           = (known after apply)
[network/vpc] :           + cidr_block                                     = "192.169.1.0/24"
[network/vpc] :           + customer_owned_ipv4_pool                       = null
[network/vpc] :           + enable_dns64                                   = false
[network/vpc] :           + enable_lni_at_device_index                     = null
[network/vpc] :           + enable_resource_name_dns_a_record_on_launch    = false
[network/vpc] :           + enable_resource_name_dns_aaaa_record_on_launch = false
[network/vpc] :           + id                                             = (known after apply)
[network/vpc] :           + ipv6_cidr_block                                = null
[network/vpc] :           + ipv6_cidr_block_association_id                 = (known after apply)
[network/vpc] :           + ipv6_native                                    = false
[network/vpc] :           + map_customer_owned_ip_on_launch                = null
[network/vpc] :           + map_public_ip_on_launch                        = true
[network/vpc] :           + outpost_arn                                    = null
[network/vpc] :           + owner_id                                       = (known after apply)
[network/vpc] :           + private_dns_hostname_type_on_launch            = (known after apply)
[network/vpc] :           + tags                                           = {
[network/vpc] :               + application_name = "bar"
[network/vpc] :               + contact_email    = "bar-team@example.com"
[network/vpc] :               + environment      = "development"
[network/vpc] :               + managed_by       = "terraform"
[network/vpc] :               + name             = "public-subnet-bar-app-dev-1a"
[network/vpc] :               + team_owner       = "bar-team"
[network/vpc] :             }
[network/vpc] :           + tags_all                                       = {
[network/vpc] :               + application_name = "bar"
[network/vpc] :               + contact_email    = "bar-team@example.com"
[network/vpc] :               + environment      = "development"
[network/vpc] :               + managed_by       = "terraform"
[network/vpc] :               + name             = "public-subnet-bar-app-dev-1a"
[network/vpc] :               + team_owner       = "bar-team"
[network/vpc] :             }
[network/vpc] :           + timeouts                                       = null
[network/vpc] :           + vpc_id                                         = (known after apply)
[network/vpc] :         }
[network/vpc] :     }
[network/vpc] :   + vpc_id                    = (known after apply)
[network/vpc] : aws_vpc.this: Creating...
[network/vpc] : aws_eip.this: Creating...
[network/vpc] : aws_iam_role.this[0]: Creating...
[network/vpc] : aws_iam_policy.this[0]: Creating...
[network/vpc] : aws_iam_policy.this[0]: Creation complete after 1s [id=arn:aws:iam::000000000000:policy/flow-log-policy-bar-app-dev]
[network/vpc] : aws_iam_role.this[0]: Creation complete after 1s [id=flow-log-role-bar-app-dev]
[network/vpc] : aws_iam_role_policy_attachment.this[0]: Creating...
[network/vpc] : aws_iam_role_policy_attachment.this[0]: Creation complete after 0s [id=flow-log-role-bar-app-dev-20250717205517141200000001]
[network/vpc] : aws_eip.this: Creation complete after 2s [id=eipalloc-dddd4a2ad14d282f1]
[network/vpc] : aws_vpc.this: Still creating... [10s elapsed]
[network/vpc] : aws_vpc.this: Creation complete after 12s [id=vpc-dc954d47ccbc86291]
[network/vpc] : aws_internet_gateway.this: Creating...
[network/vpc] : aws_subnet.private["private-subnet-2"]: Creating...
[network/vpc] : aws_subnet.private["private-subnet-1"]: Creating...
[network/vpc] : aws_cloudwatch_log_group.this[0]: Creating...
[network/vpc] : aws_subnet.public["public-subnet-1"]: Creating...
[network/vpc] : aws_subnet.private["private-subnet-1"]: Creation complete after 0s [id=subnet-90a184fcc76f45e1f]
[network/vpc] : aws_subnet.private["private-subnet-2"]: Creation complete after 0s [id=subnet-adaaecde48562d994]
[network/vpc] : aws_internet_gateway.this: Creation complete after 0s [id=igw-b0628cd5863395fbb]
[network/vpc] : aws_route_table.public: Creating...
[network/vpc] : aws_cloudwatch_log_group.this[0]: Creation complete after 0s [id=/aws/vpc/flow-logs/vpc-dc954d47ccbc86291]
[network/vpc] : aws_flow_log.this[0]: Creating...
[network/vpc] : aws_flow_log.this[0]: Creation complete after 0s [id=fl-ee9bb84c0baf7ab1e]
[network/vpc] : aws_route_table.public: Creation complete after 0s [id=rtb-62c4622944c4b65cc]
[network/vpc] : aws_subnet.public["public-subnet-1"]: Still creating... [10s elapsed]
[network/vpc] : aws_subnet.public["public-subnet-1"]: Creation complete after 10s [id=subnet-719e39712646d773c]
[network/vpc] : aws_route_table_association.public["public-subnet-1"]: Creating...
[network/vpc] : aws_nat_gateway.this: Creating...
[network/vpc] : aws_route_table_association.public["public-subnet-1"]: Creation complete after 0s [id=rtbassoc-76da7df66c2c776f7]
[network/vpc] : aws_nat_gateway.this: Creation complete after 0s [id=nat-2437db00889616d3d]
[network/vpc] : aws_route_table.private: Creating...
[network/vpc] : aws_route_table.private: Creation complete after 0s [id=rtb-4688f4ac581572dbf]
[network/vpc] : aws_route_table_association.private["private-subnet-2"]: Creating...
[network/vpc] : aws_route_table_association.private["private-subnet-1"]: Creating...
[network/vpc] : aws_route_table_association.private["private-subnet-2"]: Creation complete after 0s [id=rtbassoc-0362f4fb025389c29]
[network/vpc] : aws_route_table_association.private["private-subnet-1"]: Creation complete after 0s [id=rtbassoc-2e656092c1d50374a]
[network/vpc] : Apply complete! Resources: 17 added, 0 changed, 0 destroyed.
[network/vpc] : Outputs:
[network/vpc] : cloudwatch_log_group_name = "/aws/vpc/flow-logs/vpc-dc954d47ccbc86291"
[network/vpc] : flow_log_id = "fl-ee9bb84c0baf7ab1e"
[network/vpc] : internet_gateway_id = "igw-b0628cd5863395fbb"
[network/vpc] : nat_gateway_id = "nat-2437db00889616d3d"
[network/vpc] : private_subnets = {
[network/vpc] :   "private-subnet-1" = {
[network/vpc] :     "arn" = "arn:aws:ec2:us-west-1:000000000000:subnet/subnet-90a184fcc76f45e1f"
[network/vpc] :     "assign_ipv6_address_on_creation" = false
[network/vpc] :     "availability_zone" = "us-west-1a"
[network/vpc] :     "availability_zone_id" = "usw1-az3"
[network/vpc] :     "cidr_block" = "192.169.2.0/24"
[network/vpc] :     "customer_owned_ipv4_pool" = ""
[network/vpc] :     "enable_dns64" = false
[network/vpc] :     "enable_lni_at_device_index" = 0
[network/vpc] :     "enable_resource_name_dns_a_record_on_launch" = false
[network/vpc] :     "enable_resource_name_dns_aaaa_record_on_launch" = false
[network/vpc] :     "id" = "subnet-90a184fcc76f45e1f"
[network/vpc] :     "ipv6_cidr_block" = ""
[network/vpc] :     "ipv6_cidr_block_association_id" = ""
[network/vpc] :     "ipv6_native" = false
[network/vpc] :     "map_customer_owned_ip_on_launch" = false
[network/vpc] :     "map_public_ip_on_launch" = false
[network/vpc] :     "outpost_arn" = ""
[network/vpc] :     "owner_id" = "000000000000"
[network/vpc] :     "private_dns_hostname_type_on_launch" = "ip-name"
[network/vpc] :     "tags" = tomap({
[network/vpc] :       "application_name" = "bar"
[network/vpc] :       "contact_email" = "bar-team@example.com"
[network/vpc] :       "environment" = "development"
[network/vpc] :       "managed_by" = "terraform"
[network/vpc] :       "name" = "private-subnet-bar-app-dev-1a"
[network/vpc] :       "team_owner" = "bar-team"
[network/vpc] :     })
[network/vpc] :     "tags_all" = tomap({
[network/vpc] :       "application_name" = "bar"
[network/vpc] :       "contact_email" = "bar-team@example.com"
[network/vpc] :       "environment" = "development"
[network/vpc] :       "managed_by" = "terraform"
[network/vpc] :       "name" = "private-subnet-bar-app-dev-1a"
[network/vpc] :       "team_owner" = "bar-team"
[network/vpc] :     })
[network/vpc] :     "timeouts" = null /* object */
[network/vpc] :     "vpc_id" = "vpc-dc954d47ccbc86291"
[network/vpc] :   }
[network/vpc] :   "private-subnet-2" = {
[network/vpc] :     "arn" = "arn:aws:ec2:us-west-1:000000000000:subnet/subnet-adaaecde48562d994"
[network/vpc] :     "assign_ipv6_address_on_creation" = false
[network/vpc] :     "availability_zone" = "us-west-1b"
[network/vpc] :     "availability_zone_id" = "usw1-az1"
[network/vpc] :     "cidr_block" = "192.169.3.0/24"
[network/vpc] :     "customer_owned_ipv4_pool" = ""
[network/vpc] :     "enable_dns64" = false
[network/vpc] :     "enable_lni_at_device_index" = 0
[network/vpc] :     "enable_resource_name_dns_a_record_on_launch" = false
[network/vpc] :     "enable_resource_name_dns_aaaa_record_on_launch" = false
[network/vpc] :     "id" = "subnet-adaaecde48562d994"
[network/vpc] :     "ipv6_cidr_block" = ""
[network/vpc] :     "ipv6_cidr_block_association_id" = ""
[network/vpc] :     "ipv6_native" = false
[network/vpc] :     "map_customer_owned_ip_on_launch" = false
[network/vpc] :     "map_public_ip_on_launch" = false
[network/vpc] :     "outpost_arn" = ""
[network/vpc] :     "owner_id" = "000000000000"
[network/vpc] :     "private_dns_hostname_type_on_launch" = "ip-name"
[network/vpc] :     "tags" = tomap({
[network/vpc] :       "application_name" = "bar"
[network/vpc] :       "contact_email" = "bar-team@example.com"
[network/vpc] :       "environment" = "development"
[network/vpc] :       "managed_by" = "terraform"
[network/vpc] :       "name" = "private-subnet-bar-app-dev-1c"
[network/vpc] :       "team_owner" = "bar-team"
[network/vpc] :     })
[network/vpc] :     "tags_all" = tomap({
[network/vpc] :       "application_name" = "bar"
[network/vpc] :       "contact_email" = "bar-team@example.com"
[network/vpc] :       "environment" = "development"
[network/vpc] :       "managed_by" = "terraform"
[network/vpc] :       "name" = "private-subnet-bar-app-dev-1c"
[network/vpc] :       "team_owner" = "bar-team"
[network/vpc] :     })
[network/vpc] :     "timeouts" = null /* object */
[network/vpc] :     "vpc_id" = "vpc-dc954d47ccbc86291"
[network/vpc] :   }
[network/vpc] : }
[network/vpc] : public_subnets = {
[network/vpc] :   "public-subnet-1" = {
[network/vpc] :     "arn" = "arn:aws:ec2:us-west-1:000000000000:subnet/subnet-719e39712646d773c"
[network/vpc] :     "assign_ipv6_address_on_creation" = false
[network/vpc] :     "availability_zone" = "us-west-1a"
[network/vpc] :     "availability_zone_id" = "usw1-az3"
[network/vpc] :     "cidr_block" = "192.169.1.0/24"
[network/vpc] :     "customer_owned_ipv4_pool" = ""
[network/vpc] :     "enable_dns64" = false
[network/vpc] :     "enable_lni_at_device_index" = 0
[network/vpc] :     "enable_resource_name_dns_a_record_on_launch" = false
[network/vpc] :     "enable_resource_name_dns_aaaa_record_on_launch" = false
[network/vpc] :     "id" = "subnet-719e39712646d773c"
[network/vpc] :     "ipv6_cidr_block" = ""
[network/vpc] :     "ipv6_cidr_block_association_id" = ""
[network/vpc] :     "ipv6_native" = false
[network/vpc] :     "map_customer_owned_ip_on_launch" = false
[network/vpc] :     "map_public_ip_on_launch" = true
[network/vpc] :     "outpost_arn" = ""
[network/vpc] :     "owner_id" = "000000000000"
[network/vpc] :     "private_dns_hostname_type_on_launch" = "ip-name"
[network/vpc] :     "tags" = tomap({
[network/vpc] :       "application_name" = "bar"
[network/vpc] :       "contact_email" = "bar-team@example.com"
[network/vpc] :       "environment" = "development"
[network/vpc] :       "managed_by" = "terraform"
[network/vpc] :       "name" = "public-subnet-bar-app-dev-1a"
[network/vpc] :       "team_owner" = "bar-team"
[network/vpc] :     })
[network/vpc] :     "tags_all" = tomap({
[network/vpc] :       "application_name" = "bar"
[network/vpc] :       "contact_email" = "bar-team@example.com"
[network/vpc] :       "environment" = "development"
[network/vpc] :       "managed_by" = "terraform"
[network/vpc] :       "name" = "public-subnet-bar-app-dev-1a"
[network/vpc] :       "team_owner" = "bar-team"
[network/vpc] :     })
[network/vpc] :     "timeouts" = null /* object */
[network/vpc] :     "vpc_id" = "vpc-dc954d47ccbc86291"
[network/vpc] :   }
[network/vpc] : }
[network/vpc] : vpc_id = "vpc-dc954d47ccbc86291"
20:55:38.435 INFO   Shutting down Terragrunt Cache server...
20:55:38.435 INFO   Terragrunt Cache server stopped</pre>
</details>